Конфигурация/DataProcessors/МенеджерОтложенныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>МенеджерОтложенныхЗаданий</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/ОтложенныеЗадания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОтложенныеЗадания</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОтложенныхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПерезапускатьПоИстечениюТаймаута</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапускаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОшибкиОтмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПараметров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФоновогоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сложность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтерактивныйЗапуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ХранилищеЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ХранилищеЗначений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранилищеЗначения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУдалять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/СостоянияОтложенныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияОтложенныхЗаданий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/DataProcessors/МенеджерОтложенныхЗаданий/Ext/ManagerModule.bsl
Функция ПолучитьПараметрыФормированияБухгалтерскогоУчета() Экспорт

	ПараметрыФормированияБухгалтерскогоУчета = Новый Структура;
	
	ПараметрыФормированияБухгалтерскогоУчета.Вставить("МаксимальноеКоличествоПартийВПереоценке",		50000);
	ПараметрыФормированияБухгалтерскогоУчета.Вставить("МаксимальноеЧислоЗаданийНаОрганизацию",			10);
	ПараметрыФормированияБухгалтерскогоУчета.Вставить("МаксимальноеЧислоЗаданийНаПользователя",			8);
	ПараметрыФормированияБухгалтерскогоУчета.Вставить("ОбъектФормированияБухгалтерскогоУчета",			"Обработки.ФормированиеБухгалтерскогоУчета");
	ПараметрыФормированияБухгалтерскогоУчета.Вставить("КомандаФормированияБухгалтерскогоУчета",			"ОбработатьСчетДУФоново");
	
	Возврат ПараметрыФормированияБухгалтерскогоУчета;

КонецФункции

Функция ЗапуститьЗаданиеФормированияБухгалтерскогоУчета(Выборка)

	Экземпляры = Новый ТаблицаЗначений;
				
	Экземпляры.Колонки.Добавить("Идентификатор");
	Экземпляры.Колонки.Добавить("Параметры");
	
	НовоеЗадание = Экземпляры.Добавить();
	
	НовоеЗадание.Идентификатор	= Выборка.Идентификатор;
	НовоеЗадание.Параметры		= Выборка.Параметры.Получить();
	
	
	ПараметрыМетода = Новый Массив;
	ПараметрыМетода.Добавить(Выборка.Объект);
	ПараметрыМетода.Добавить(Выборка.Команда);
	ПараметрыМетода.Добавить(Экземпляры);
	
	УИДЗадания = Новый УникальныйИдентификатор();
	НаименованиеЗадания = "Запуск отложенного задания: " + Выборка.Объект + " ('" + Выборка.Команда + "'). ИД: " + Строка(УИДЗадания);
	
	Возврат ФоновыеЗадания.Выполнить("РаботаСРегламентнымиЗаданиями.ЗапуститьОтложенноеЗадание", ПараметрыМетода, УИДЗадания, НаименованиеЗадания);

КонецФункции

Процедура ДобавитьЗаданияВМассивОжидаемых(МассивОжидаемых, Задания, МассивОЗКОтмене, МассивОЗКЗавершению, ИдентификаторМастера, ПривилегированныйРежим = Ложь)

	Если ПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	Для каждого СтрокаЗадания Из Задания Цикл
		Если СтрокаЗадания.ИдентификаторФоновогоЗадания = ИдентификаторМастера Тогда // это возникает когда, ФЗ не смог запуститься
		    МассивОЗКОтмене.Добавить(СтрокаЗадания.Идентификатор);
		Иначе
			ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(СтрокаЗадания.ИдентификаторФоновогоЗадания);
			Если ФоновоеЗадание = Неопределено Тогда// если ФЗ умерло(убито системой), отменено или свалилось с ошибкой
				
				// прошла уже минута, а ФЗ так и не запустилось - значит и не запустится, условие поставлено чтобы не убивать те ОЗ, по которым запуск ФЗ протормозил
				Если ТекущаяДатаСеанса() - СтрокаЗадания.ДатаЗапуска > 60 Тогда 
					
					МассивОЗКОтмене.Добавить(СтрокаЗадания.Идентификатор); // отдаем сборщику мусора
				
				КонецЕсли;
				
			ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Отменено
				 ИЛИ ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			
				МассивОЗКОтмене.Добавить(СтрокаЗадания.Идентификатор); // отдаем сборщику мусора
				
			ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
				
				МассивОжидаемых.Добавить(ФоновоеЗадание); // ждем завершения
				
			ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
				
				МассивОЗКЗавершению.Добавить(СтрокаЗадания.Идентификатор); 
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура МастерЗаданийФормированияБухгалтерскогоУчета(Параметры) Экспорт

	СеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = СеансИнформационнойБазы.ПолучитьФоновоеЗадание();
	ИдентификаторМастера = ФоновоеЗадание.УникальныйИдентификатор;
	
	ПараметрыФормированияБухгалтерскогоУчета = Обработки.МенеджерОтложенныхЗаданий.ПолучитьПараметрыФормированияБухгалтерскогоУчета();	
	
	Организация 	= Параметры.Организация;
	Пользователь	= Параметры.Пользователь;
	
	Пока Истина Цикл
		
		Запрос = Новый Запрос;
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("ОбъектФормированияБухгалтерскогоУчета",			ПараметрыФормированияБухгалтерскогоУчета.ОбъектФормированияБухгалтерскогоУчета);
		Запрос.УстановитьПараметр("КомандаФормированияБухгалтерскогоУчета",			ПараметрыФормированияБухгалтерскогоУчета.КомандаФормированияБухгалтерскогоУчета);
		Запрос.УстановитьПараметр("Организация", 									Организация);
		Запрос.УстановитьПараметр("Пользователь", 									Пользователь);
		
		#Область Текст_запроса
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОтложенныеЗадания.Идентификатор КАК Идентификатор,
			|	ОтложенныеЗадания.Объект КАК Объект,
			|	ОтложенныеЗадания.Команда КАК Команда,
			|	ОтложенныеЗадания.Параметры КАК Параметры,
			|	ОтложенныеЗадания.Состояние КАК Состояние,
			|	ОтложенныеЗадания.Организация КАК Организация,
			|	ОтложенныеЗадания.Сложность КАК Сложность,
			|	ОтложенныеЗадания.Пользователь КАК Пользователь,
			|	ОтложенныеЗадания.ИдентификаторФоновогоЗадания КАК ИдентификаторФоновогоЗадания,
			|	ОтложенныеЗадания.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ОтложенныеЗадания.ВидУчета КАК ВидУчета,
			|	ВЫБОР
			|		КОГДА ОтложенныеЗадания.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
			|			ТОГДА 1
			|		КОГДА ОтложенныеЗадания.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
			|			ТОГДА 2
			|		ИНАЧЕ 3
			|	КОНЕЦ КАК ПорядокУчета,
			|	ОтложенныеЗадания.ДатаЗапуска КАК ДатаЗапуска
			|ПОМЕСТИТЬ _ВсеЗадания
			|ИЗ
			|	РегистрСведений.ОтложенныеЗадания КАК ОтложенныеЗадания
			|ГДЕ
			|	ОтложенныеЗадания.Организация = &Организация
			|	И ОтложенныеЗадания.Объект = &ОбъектФормированияБухгалтерскогоУчета
			|	И ОтложенныеЗадания.Команда = &КомандаФормированияБухгалтерскогоУчета
			|	И ОтложенныеЗадания.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияОтложенныхЗаданий.Ожидание), ЗНАЧЕНИЕ(Перечисление.СостоянияОтложенныхЗаданий.Выполняется))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ВсеЗадания.Идентификатор КАК Идентификатор,
			|	_ВсеЗадания.ИдентификаторФоновогоЗадания КАК ИдентификаторФоновогоЗадания,
			|	_ВсеЗадания.ДатаЗапуска КАК ДатаЗапуска
			|ПОМЕСТИТЬ _ВыполняютсяВсе
			|ИЗ
			|	_ВсеЗадания КАК _ВсеЗадания
			|ГДЕ
			|	_ВсеЗадания.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтложенныхЗаданий.Выполняется)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ВсеЗадания.Идентификатор КАК Идентификатор,
			|	_ВсеЗадания.ИдентификаторФоновогоЗадания КАК ИдентификаторФоновогоЗадания,
			|	_ВсеЗадания.Организация КАК Организация,
			|	_ВсеЗадания.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_ВсеЗадания.ВидУчета КАК ВидУчета,
			|	_ВсеЗадания.ДатаЗапуска КАК ДатаЗапуска
			|ПОМЕСТИТЬ _ВыполняютсяЭтогоПользователя
			|ИЗ
			|	_ВсеЗадания КАК _ВсеЗадания
			|ГДЕ
			|	_ВсеЗадания.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтложенныхЗаданий.Выполняется)
			|	И _ВсеЗадания.Пользователь = &Пользователь
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10
			|	_ВсеЗадания.Идентификатор КАК Идентификатор,
			|	_ВсеЗадания.Объект КАК Объект,
			|	_ВсеЗадания.Команда КАК Команда,
			|	_ВсеЗадания.Параметры КАК Параметры,
			|	_ВсеЗадания.Организация КАК Организация,
			|	_ВсеЗадания.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_ВсеЗадания.ВидУчета КАК ВидУчета,
			|	_ВсеЗадания.ПорядокУчета КАК ПорядокУчета
			|ПОМЕСТИТЬ _ОжидаютЭтогоПользователя
			|ИЗ
			|	_ВсеЗадания КАК _ВсеЗадания
			|ГДЕ
			|	_ВсеЗадания.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтложенныхЗаданий.Ожидание)
			|	И _ВсеЗадания.Пользователь = &Пользователь
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПорядокУчета";
		
		#КонецОбласти 
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "10", Строка(ПараметрыФормированияБухгалтерскогоУчета.МаксимальноеЧислоЗаданийНаОрганизацию));
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОтложенныеЗадания");
		ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
		ЭлементБлокировки.УстановитьЗначение("Объект", ПараметрыФормированияБухгалтерскогоУчета.ОбъектФормированияБухгалтерскогоУчета);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		НачатьТранзакцию();
		
		Блокировка.Заблокировать();
		
		Запрос.Выполнить();
		
		ВыполняютсяВсе						= Запрос.МенеджерВременныхТаблиц.Таблицы["_ВыполняютсяВсе"].ПолучитьДанные().Выгрузить();
		ВыполняютсяЭтогоПользователя		= Запрос.МенеджерВременныхТаблиц.Таблицы["_ВыполняютсяЭтогоПользователя"].ПолучитьДанные().Выгрузить();
		ОжидаютЭтогоПользователя			= Запрос.МенеджерВременныхТаблиц.Таблицы["_ОжидаютЭтогоПользователя"].ПолучитьДанные().Выгрузить();
		
		МассивФЗКЗапуску = Новый Массив; 	// это будет массив ОЗ, находящихся в промежуточном статусе 'Подготовлен к запуску', он нужен чтобы 2х секундные ожидания при запуске ФЗ вынести за транзакцию
		МассивФЗКОжиданию = Новый Массив; 	// это будет массив ФЗ окончания работы которых мы будем ждать
		МассивОЗКОтмене = Новый Массив; 	// это будет массив ОЗ, ФЗ по которым уже вылетел, но сами они еще в статусе 'выполняются' - по ним будем проставлять статус "ошибка"
		МассивОЗКЗавершению = Новый Массив; // это будет массив ОЗ, ФЗ по которым уже завершился, но сами они еще в статусе 'выполняются' - по ним будем проставлять статус "завершено"
		
		Если ОжидаютЭтогоПользователя.Количество() = 0 Тогда // всё, всех сформировали, но подождем наших, которые формируются
			
			ДобавитьЗаданияВМассивОжидаемых(МассивФЗКОжиданию, ВыполняютсяЭтогоПользователя, МассивОЗКОтмене, МассивОЗКЗавершению, ИдентификаторМастера);
			
		Иначе 
			
			ДобавитьЗаданияВМассивОжидаемых(МассивФЗКОжиданию, ВыполняютсяВсе, МассивОЗКОтмене, МассивОЗКЗавершению, ИдентификаторМастера, Истина);
			
			МожноЗапуститьИсходяИзОрганизации = Макс(ПараметрыФормированияБухгалтерскогоУчета.МаксимальноеЧислоЗаданийНаОрганизацию - ВыполняютсяВсе.Количество(), 0);
			МожноЗапуститьИсходяИзПользователя = Макс(ПараметрыФормированияБухгалтерскогоУчета.МаксимальноеЧислоЗаданийНаПользователя - ВыполняютсяЭтогоПользователя.Количество(), 0);
			
			МожноЗапуститьЗаданий = Мин(МожноЗапуститьИсходяИзОрганизации, МожноЗапуститьИсходяИзПользователя);
			
			Для каждого ОжидаемоеЗадание Из ОжидаютЭтогоПользователя Цикл
				
				Если МожноЗапуститьЗаданий = 0 Тогда
					Прервать;
				КонецЕсли;
				
				// это ради ситуации когда параллельно проводятся БУ и НУ по одному счету - они часто начинают конфликтовать, пытаясь провести один документ одновременно
				Если ВыполняютсяЭтогоПользователя.НайтиСтроки(Новый Структура("СчетДоверительногоУправления", ОжидаемоеЗадание.СчетДоверительногоУправления)).Количество() > 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Если РаботаСРегламентнымиЗаданиями.ЗафиксироватьЗапускОтложенногоЗадания(ОжидаемоеЗадание.Идентификатор) Тогда
					
					МассивФЗКЗапуску.Добавить(ОжидаемоеЗадание);
					
					ВыполняютсяЭтогоПользователя.Добавить().СчетДоверительногоУправления = ОжидаемоеЗадание.СчетДоверительногоУправления;
					
					МожноЗапуститьЗаданий = МожноЗапуститьЗаданий - 1;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
		Если МассивОЗКОтмене.Количество() > 0 Тогда // запомним этот момент
			
			Запись = РегистрыСведений.ХранилищеЗначений.СоздатьМенеджерЗаписи();
			Запись.Идентификатор     = Новый УникальныйИдентификатор();
			Запись.ДатаСоздания      = ТекущаяДата();
			Запись.ХранилищеЗначения = Новый ХранилищеЗначения(МассивОЗКОтмене, Новый СжатиеДанных(9));
			Запись.Источник          = ПараметрыФормированияБухгалтерскогоУчета.ОбъектФормированияБухгалтерскогоУчета;
			Запись.Комментарий		 = "Задания к отмене";
			Запись.Записать();
			
			Если МассивФЗКЗапуску.Количество() > 0 Тогда
				
				МассивДляСериализации = Новый Массив;
				Для каждого ФЗКЗапуску Из МассивФЗКЗапуску Цикл
					МассивДляСериализации.Добавить(ФЗКЗапуску.Идентификатор);
				КонецЦикла;
				
				Запись = РегистрыСведений.ХранилищеЗначений.СоздатьМенеджерЗаписи();
				Запись.Идентификатор     = Новый УникальныйИдентификатор();
				Запись.ДатаСоздания      = ТекущаяДата();
				Запись.ХранилищеЗначения = Новый ХранилищеЗначения(МассивДляСериализации, Новый СжатиеДанных(9));
				Запись.Источник          = ПараметрыФормированияБухгалтерскогоУчета.ОбъектФормированияБухгалтерскогоУчета;
				Запись.Комментарий		 = "Задания к запуску";
				Запись.Записать();
			
			КонецЕсли;
			
			Если МассивОЗКЗавершению.Количество() > 0 Тогда
			
				Запись = РегистрыСведений.ХранилищеЗначений.СоздатьМенеджерЗаписи();
				Запись.Идентификатор     = Новый УникальныйИдентификатор();
				Запись.ДатаСоздания      = ТекущаяДата();
				Запись.ХранилищеЗначения = Новый ХранилищеЗначения(МассивОЗКЗавершению, Новый СжатиеДанных(9));
				Запись.Источник          = ПараметрыФормированияБухгалтерскогоУчета.ОбъектФормированияБухгалтерскогоУчета;
				Запись.Комментарий		 = "Задания к завершению";
				Запись.Записать();
			
			КонецЕсли;
			
			Если МассивФЗКОжиданию.Количество() > 0 Тогда
			
				Запись = РегистрыСведений.ХранилищеЗначений.СоздатьМенеджерЗаписи();
				Запись.Идентификатор     = Новый УникальныйИдентификатор();
				Запись.ДатаСоздания      = ТекущаяДата();
				Запись.ХранилищеЗначения = Новый ХранилищеЗначения(МассивФЗКОжиданию, Новый СжатиеДанных(9));
				Запись.Источник          = ПараметрыФормированияБухгалтерскогоУчета.ОбъектФормированияБухгалтерскогоУчета;
				Запись.Комментарий		 = "Задания, которые выполняются";
				Запись.Записать();
			
			КонецЕсли;
		
		КонецЕсли;
				
		// ФЗ, упавшие с ошибкой - отменим
		Для каждого ОЗКОтмене Из МассивОЗКОтмене Цикл 
			РаботаСРегламентнымиЗаданиями.ОтменитьОтложенноеЗадание(ОЗКОтмене);
		КонецЦикла;
		
		// ФЗ к запуску - запустим
		Для каждого ФЗКЗапуску Из МассивФЗКЗапуску Цикл
			МассивФЗКОжиданию.Добавить(ЗапуститьЗаданиеФормированияБухгалтерскогоУчета(ФЗКЗапуску));
		КонецЦикла;
		
		// по ФЗ отработавшим - зфиксируем факт выполнения
		Для каждого ОЗКЗавершению Из МассивОЗКЗавершению Цикл 
			РаботаСРегламентнымиЗаданиями.ЗафиксироватьВыполнениеОтложенногоЗадания(ОЗКЗавершению);
		КонецЦикла;
		
		
		Если МассивФЗКОжиданию.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;	

		УстановитьПривилегированныйРежим(Истина);
		
		Попытка // иногда ФЗ успевает выполниться до этого момента
			
			_Масс = ФоновыеЗадания.ОжидатьЗавершенияВыполнения(МассивФЗКОжиданию);
			
		Исключение // сохраним массив, чтобы посмотреть потом что там
			
			Запись = РегистрыСведений.ХранилищеЗначений.СоздатьМенеджерЗаписи();
			Запись.Идентификатор = ИдентификаторМастера;
			Запись.Прочитать();
			
			Если Запись.Выбран() Тогда
				// уже что-то сохраняли - больше не будем
			Иначе
				Запись.Идентификатор		= ИдентификаторМастера;
				Запись.ХранилищеЗначения 	= Новый ХранилищеЗначения(МассивФЗКОжиданию, Новый СжатиеДанных(9));
				Запись.Источник 			= ПараметрыФормированияБухгалтерскогоУчета.ОбъектФормированияБухгалтерскогоУчета;
				Запись.Записать();
			КонецЕсли; 
			
		КонецПопытки;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗапуститьМастерЗаданийФормированияБухгалтерскогоУчета(Организация, Пользователь) Экспорт

	КлючЗадания = Пользователь.Код;
	
	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Ключ,Состояние", КлючЗадания, СостояниеФоновогоЗадания.Активно));
	Если МассивФоновыхЗаданий.Количество() = 0 Тогда
	
		ПараметрыМетода = Новый Массив;
		ПараметрыМетода.Добавить(Новый Структура("Организация, Пользователь", Организация, Пользователь));
		
		ПараметрыЗадания = Новый Массив;
		ПараметрыЗадания.Добавить("Обработки.МенеджерОтложенныхЗаданий.МастерЗаданийФормированияБухгалтерскогоУчета");
		ПараметрыЗадания.Добавить(ПараметрыМетода);
		
		Попытка
			ФоновоеЗадание = ФоновыеЗадания.Выполнить("СистемныеФункции.ВыполнитьМетодКонфигурации", ПараметрыЗадания, КлючЗадания, "МастерЗаданийФормированияБухгалтерскогоУчета");
		Исключение
			// значит мастер-формирователь уже работает и ничего делать не надо
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры
